# Pandas

In [1]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\masum\.conda\envs\ml_learn_env\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\masum\.conda\envs\ml_learn_env\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\masum\.conda\envs\ml_learn_env\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\masum\.conda\envs\ml_learn_env\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\masum\.conda\envs\ml_learn_env\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\masum\.conda\envs\ml_learn_env\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
# impoort pandas as pd
import pandas as pd

In [3]:
pd.__version__

'2.3.3'

In [4]:
# Series
# A one-dimensional labeled array capable of holding any data type
data=[1,2,3,4,5]
series=pd.Series(data)
print(type(series))
series

<class 'pandas.core.series.Series'>

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
# create series from dictionary
data={'a':10,'b':20,'c':30}
series=pd.Series(data)
series

a    10
b    20
c    30
dtype: int64

In [6]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [14]:
# DataFrame
# A two-dimensional labeled data structure with columns of potentially different types
# create DataFrame from dictionary
data={
    'Name': ['Masum','mohua','Billah'],
    'age':[24,30,45],
    'city': ['dhaka','rajshahi','mirpur']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  age      city
0   Masum   24     dhaka
1   mohua   30  rajshahi
2  Billah   45    mirpur
<class 'pandas.core.frame.DataFrame'>

In [8]:
# crate a datafram from list of dictionaries
data=[
    {'Name': 'Masum', 'age':24, 'city':'dhaka'},
    {'Name': 'mohua', 'age':30, 'city':'rajshahi'},
    {'Name': 'Billah', 'age':45, 'city':'mirpur'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  age      city
0   Masum   24     dhaka
1   mohua   30  rajshahi
2  Billah   45    mirpur
<class 'pandas.core.frame.DataFrame'>

In [12]:
# read data from csv file
df=pd.read_csv("../sales_data.csv")
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [13]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [17]:
## accessing data from DataFrame
df

     Name  age      city
0   Masum   24     dhaka
1   mohua   30  rajshahi
2  Billah   45    mirpur

In [21]:
df['Name']

0     Masum
1     mohua
2    Billah
Name: Name, dtype: object

In [23]:
df.loc[0] # access first row

Name    Masum
age        24
city    dhaka
Name: 0, dtype: object

In [24]:
df.iloc[0] # access first row by index

Name    Masum
age        24
city    dhaka
Name: 0, dtype: object

In [ ]:
df.loc[0][0] # access first row first column

C:\Users\masum\AppData\Local\Temp\ipykernel_26128\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Masum'

In [27]:
df

     Name  age      city
0   Masum   24     dhaka
1   mohua   30  rajshahi
2  Billah   45    mirpur

In [26]:
## Accessing a specific element 
df.at[1,'age']

np.int64(30)

In [29]:
# Accessing a specific element by iat
df.iat[1,2]

'rajshahi'

In [30]:
df

     Name  age      city
0   Masum   24     dhaka
1   mohua   30  rajshahi
2  Billah   45    mirpur

In [31]:
# Data Manupulation with DataFrame
# Adding a new column
df['salary']=[50000,60000,70000]
df

     Name  age      city  salary
0   Masum   24     dhaka   50000
1   mohua   30  rajshahi   60000
2  Billah   45    mirpur   70000

In [32]:
# removing a column
df.drop('salary',axis=1,inplace=True)

In [33]:
## add age column by increasing 5 years
df['age']=df['age']+5
df

     Name  age      city
0   Masum   29     dhaka
1   mohua   35  rajshahi
2  Billah   50    mirpur

In [34]:
# drop based on row
df.drop(0,axis=0,inplace=True)
df

     Name  age      city
1   mohua   35  rajshahi
2  Billah   50    mirpur

In [35]:
# display the type of each column
print(f"Data types of each column:\n{df.dtypes}")

# descibe the DataFrame
print(f"Statistical summary of the DataFrame:\n{df.describe()}")

Data types of each column:
Name    object
age      int64
city    object
dtype: object
Statistical summary of the DataFrame:
             age
count   2.000000
mean   42.500000
std    10.606602
min    35.000000
25%    38.750000
50%    42.500000
75%    46.250000
max    50.000000